In [107]:
import pandas as pd

In [108]:
df = pd.DataFrame({'nome': ['Rafael', 'João', 'Maria','Lucas','Lúcia','Ana'], 
                   'Altura': [175,165,160,180,165,170],
                   'sexo': ['M','M','F','M','F','F']})

In [109]:
df

     nome  Altura sexo
0  Rafael     175    M
1    João     165    M
2   Maria     160    F
3   Lucas     180    M
4   Lúcia     165    F
5     Ana     170    F

In [110]:
df[df.Altura < 180].groupby('sexo').mean()

C:\Users\Deivi\AppData\Local\Temp\ipykernel_5908\3994598026.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df[df.Altura < 180].groupby('sexo').mean()

      Altura
sexo
F      165.0
M      170.0